Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G457.svd
<register>
  <name>ADC_IPTST</name>
  <displayName>ADC_IPTST</displayName>
  <description>ADC_IPTST</description>
  <addressOffset>0x60</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000008</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>ENCTR</name>
      <description>ENCTR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SREFLDO</name>
      <description>SREFLDO</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SRNGLDO</name>
      <description>SRNGLDO</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EXTCTRL</name>
      <description>EXTCTRL</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
</registers>

</peripheral>

<peripheral>
    <name>BKP</name>
    <description>Backup registers</description>
    <groupName>BKP</groupName>
    <baseAddress>0x40006C00</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0xC0</size>
        <usage>registers</usage>
    </addressBlock>
                <registers>
<register>
  <name>BKP_DAT1</name>
  <displayName>BKP_DAT1</displayName>
  <description>BKP_DAT1</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT2</name>
  <displayName>BKP_DAT2</displayName>
  <description>BKP_DAT2</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT3</name>
  <displayName>BKP_DAT3</displayName>
  <description>BKP_DAT3</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT4</name>
  <displayName>BKP_DAT4</displayName>
  <description>BKP_DAT4</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT5</name>
  <displayName>BKP_DAT5</displayName>
  <description>BKP_DAT5</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT6</name>
  <displayName>BKP_DAT6</displayName>
  <description>BKP_DAT6</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT7</name>
  <displayName>BKP_DAT7</displayName>
  <description>BKP_DAT7</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT8</name>
  <displayName>BKP_DAT8</displayName>
  <description>BKP_DAT8</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT9</name>
  <displayName>BKP_DAT9</displayName>
  <description>BKP_DAT9</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT10</name>
  <displayName>BKP_DAT10</displayName>
  <description>BKP_DAT10</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_CTRL</name>
  <displayName>BKP_CTRL</displayName>
  <description>BKP_CTRL</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000003</resetMask>
  <fields>
    <field>
      <name>TP_EN</name>
      <description>TP_EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TP_ALEV</name>
      <description>TP_ALEV</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_CSTS</name>
  <displayName>BKP_CSTS</displayName>
  <description>BKP_CSTS</description>
  <addressOffset>0x34</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000307</resetMask>
  <fields>
    <field>
      <name>CLRTE</name>
      <description>CLRTE</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLRTINT</name>
      <description>CLRTINT</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TPINT_EN</name>
      <description>TPINT_EN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TEF</name>
      <description>TEF</description>
      <bitOffset>3</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
    <field>
      <name>TINTF</name>
      <description>TINTF</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT11</name>
  <displayName>BKP_DAT11</displayName>
  <description>BKP_DAT11</description>
  <addressOffset>0x40</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT12</name>
  <displayName>BKP_DAT12</displayName>
  <description>BKP_DAT12</description>
  <addressOffset>0x44</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT13</name>
  <displayName>BKP_DAT13</displayName>
  <description>BKP_DAT13</description>
  <addressOffset>0x48</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT14</name>
  <displayName>BKP_DAT14</displayName>
  <description>BKP_DAT14</description>
  <addressOffset>0x4c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT15</name>
  <displayName>BKP_DAT15</displayName>
  <description>BKP_DAT15</description>
  <addressOffset>0x50</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT16</name>
  <displayName>BKP_DAT16</displayName>
  <description>BKP_DAT16</description>
  <addressOffset>0x54</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT17</name>
  <displayName>BKP_DAT17</displayName>
  <description>BKP_DAT17</description>
  <addressOffset>0x58</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00007fff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT18</name>
  <displayName>BKP_DAT18</displayName>
  <description>BKP_DAT18</description>
  <addressOffset>0x5c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT19</name>
  <displayName>BKP_DAT19</displayName>
  <description>BKP_DAT19</description>
  <addressOffset>0x60</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT20</name>
  <displayName>BKP_DAT20</displayName>
  <description>BKP_DAT20</description>
  <addressOffset>0x64</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT21</name>
  <displayName>BKP_DAT21</displayName>
  <description>BKP_DAT21</description>
  <addressOffset>0x68</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT22</name>
  <displayName>BKP_DAT22</displayName>
  <description>BKP_DAT22</description>
  <addressOffset>0x6c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT23</name>
  <displayName>BKP_DAT23</displayName>
  <description>BKP_DAT23</description>
  <addressOffset>0x70</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT24</name>
  <displayName>BKP_DAT24</displayName>
  <description>BKP_DAT24</description>
  <addressOffset>0x74</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT25</name>
  <displayName>BKP_DAT25</displayName>
  <description>BKP_DAT25</description>
  <addressOffset>0x78</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT26</name>
  <displayName>BKP_DAT26</displayName>
  <description>BKP_DAT26</description>
  <addressOffset>0x7c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT27</name>
  <displayName>BKP_DAT27</displayName>
  <description>BKP_DAT27</description>
  <addressOffset>0x80</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT28</name>
  <displayName>BKP_DAT28</displayName>
  <description>BKP_DAT28</description>
  <addressOffset>0x84</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT29</name>
  <displayName>BKP_DAT29</displayName>
  <description>BKP_DAT29</description>
  <addressOffset>0x88</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT30</name>
  <displayName>BKP_DAT30</displayName>
  <description>BKP_DAT30</description>
  <addressOffset>0x8c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT31</name>
  <displayName>BKP_DAT31</displayName>
  <description>BKP_DAT31</description>
  <addressOffset>0x90</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT32</name>
  <displayName>BKP_DAT32</displayName>
  <description>BKP_DAT32</description>
  <addressOffset>0x94</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT33</name>
  <displayName>BKP_DAT33</displayName>
  <description>BKP_DAT33</description>
  <addressOffset>0x98</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT34</name>
  <displayName>BKP_DAT34</displayName>
  <description>BKP_DAT34</description>
  <addressOffset>0x9c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT35</name>
  <displayName>BKP_DAT35</displayName>
  <description>BKP_DAT35</description>
  <addressOffset>0xa0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT36</name>
  <displayName>BKP_DAT36</displayName>
  <description>BKP_DAT36</description>
  <addressOffset>0xa4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT37</name>
  <displayName>BKP_DAT37</displayName>
  <description>BKP_DAT37</description>
  <addressOffset>0xa8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT38</name>
  <displayName>BKP_DAT38</displayName>
  <description>BKP_DAT38</description>
  <addressOffset>0xac</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT39</name>
  <displayName>BKP_DAT39</displayName>
  <description>BKP_DAT39</description>
  <addressOffset>0xb0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT40</name>
  <displayName>BKP_DAT40</displayName>
  <description>BKP_DAT40</description>
  <addressOffset>0xb4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT41</name>
  <displayName>BKP_DAT41</displayName>
  <description>BKP_DAT41</description>
  <addressOffset>0xb8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>BKP_DAT42</name>
  <displayName>BKP_DAT42</displayName>
  <description>BKP_DAT42</description>
  <addressOffset>0xbc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
