Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G457.svd
</registers>

</peripheral>

<peripheral>
    <name>TIM1</name>
    <description>Advanced timer</description>
    <groupName>TIM</groupName>
    <baseAddress>0x40012C00</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>TIM1_BRK</name>
        <description>TIM1 Break interrupt</description>
        <value>24</value>
    </interrupt>
    <interrupt>
        <name>TIM1_UP</name>
        <description>TIM1 Update interrupt</description>
        <value>25</value>
    </interrupt>
    <interrupt>
        <name>TIM1_TRG_COM</name>
        <description>TIM1 Trigger and Commutation interrupts</description>
        <value>26</value>
    </interrupt>
    <interrupt>
        <name>TIM1_CC</name>
        <description>TIM1 Capture Compare interrupt</description>
        <value>27</value>
    </interrupt>
    <registers>
<register>
  <name>TIMx_CTRL1</name>
  <displayName>TIMx_CTRL1</displayName>
  <description>TIMx_CTRL1</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0003ffff</resetMask>
  <fields>
    <field>
      <name>CNTEN</name>
      <description>CNTEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UPDIS</name>
      <description>UPDIS</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UPRS</name>
      <description>UPRS</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ONEPM</name>
      <description>ONEPM</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DIR</name>
      <description>DIR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CAMSEL</name>
      <description>CAMSEL</description>
      <bitOffset>5</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>ARPEN</name>
      <description>ARPEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLKD</name>
      <description>CLKD</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>IOMBKPEN</name>
      <description>IOMBKPEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>C1SEL</name>
      <description>C1SEL</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>C2SEL</name>
      <description>C2SEL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>C3SEL</name>
      <description>C3SEL</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>C4SEL</name>
      <description>C4SEL</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLRSEL</name>
      <description>CLRSEL</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LOCKUPEN</name>
      <description>LOCKUPEN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBKPEN</name>
      <description>PBKPEN</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_CTRL2</name>
  <displayName>TIMx_CTRL2</displayName>
  <description>TIMx_CTRL2</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00057ffd</resetMask>
  <fields>
    <field>
      <name>CCPCTL</name>
      <description>CCPCTL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CCUSEL</name>
      <description>CCUSEL</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CCDSEL</name>
      <description>CCDSEL</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MMSEL</name>
      <description>MMSEL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>TI1SEL</name>
      <description>TI1SEL</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OI1</name>
      <description>OI1</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OI1N</name>
      <description>OI1N</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OI2</name>
      <description>OI2</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OI2N</name>
      <description>OI2N</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OI3</name>
      <description>OI3</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OI3N</name>
      <description>OI3N</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OI4</name>
      <description>OI4</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OI5</name>
      <description>OI5</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OI6</name>
      <description>OI6</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_SMCTRL</name>
  <displayName>TIMx_SMCTRL</displayName>
  <description>TIMx_SMCTRL</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000fff7</resetMask>
  <fields>
    <field>
      <name>SMSEL</name>
      <description>SMSEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>TSEL</name>
      <description>TSEL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>MSMD</name>
      <description>MSMD</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EXTF</name>
      <description>EXTF</description>
      <bitOffset>8</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>EXTPS</name>
      <description>EXTPS</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>EXCEN</name>
      <description>EXCEN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EXTP</name>
      <description>EXTP</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_DINTEN</name>
  <displayName>TIMx_DINTEN</displayName>
  <description>TIMx_DINTEN</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00007fff</resetMask>
  <fields>
    <field>
      <name>UIEN</name>
      <description>UIEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC1IEN</name>
      <description>CC1IEN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC2IEN</name>
      <description>CC2IEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC3IEN</name>
      <description>CC3IEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC4IEN</name>
      <description>CC4IEN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>COMIEN</name>
      <description>COMIEN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TIEN</name>
      <description>TIEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BIEN</name>
      <description>BIEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UDEN</name>
      <description>UDEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC1DEN</name>
      <description>CC1DEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC2DEN</name>
      <description>CC2DEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC3DEN</name>
      <description>CC3DEN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC4DEN</name>
      <description>CC4DEN</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>COMDEN</name>
      <description>COMDEN</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TDEN</name>
      <description>TDEN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_STS</name>
  <displayName>TIMx_STS</displayName>
  <description>TIMx_STS</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00031eff</resetMask>
  <fields>
    <field>
      <name>UDITF</name>
      <description>UDITF</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC1ITF</name>
      <description>CC1ITF</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC2ITF</name>
      <description>CC2ITF</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC3ITF</name>
      <description>CC3ITF</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC4ITF</name>
      <description>CC4ITF</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>COMITF</name>
      <description>COMITF</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TITF</name>
      <description>TITF</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BITF</name>
      <description>BITF</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC1OCF</name>
      <description>CC1OCF</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC2OCF</name>
      <description>CC2OCF</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC3OCF</name>
      <description>CC3OCF</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC4OCF</name>
      <description>CC4OCF</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC5ITF</name>
      <description>CC5ITF</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC6ITF</name>
      <description>CC6ITF</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_EVTGEN</name>
  <displayName>TIMx_EVTGEN</displayName>
  <description>TIMx_EVTGEN</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>UDGN</name>
      <description>UDGN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC1GN</name>
      <description>CC1GN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC2GN</name>
      <description>CC2GN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC3GN</name>
      <description>CC3GN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC4GN</name>
      <description>CC4GN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CCUDGN</name>
      <description>CCUDGN</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TGN</name>
      <description>TGN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BGN</name>
      <description>BGN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_CCMOD1</name>
  <displayName>TIMx_CCMOD1</displayName>
  <description>TIMx_CCMOD1</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CC1SEL</name>
      <description>CC1SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>OC1FEN</name>
      <description>OC1FEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC1PEN</name>
      <description>OC1PEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC1M</name>
      <description>OC1M</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OC1CEN</name>
      <description>OC1CEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC2SEL</name>
      <description>CC2SEL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>OC2FEN</name>
      <description>OC2FEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC2PEN</name>
      <description>OC2PEN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC2M</name>
      <description>OC2M</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OC2CEN</name>
      <description>OC2CEN</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_CCMOD2</name>
  <displayName>TIMx_CCMOD2</displayName>
  <description>TIMx_CCMOD2</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CC3SEL</name>
      <description>CC3SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>OC3FEN</name>
      <description>OC3FEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC3PEN</name>
      <description>OC3PEN</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC3M</name>
      <description>OC3M</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OC3CEN</name>
      <description>OC3CEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC4SEL</name>
      <description>CC4SEL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>OC4FEN</name>
      <description>OC4FEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC4PEN</name>
      <description>OC4PEN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OC4M</name>
      <description>OC4M</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>OC4CEN</name>
      <description>OC4CEN</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_CCEN</name>
  <displayName>TIMx_CCEN</displayName>
  <description>TIMx_CCEN</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00333fff</resetMask>
  <fields>
    <field>
      <name>CC1EN</name>
      <description>CC1EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC1P</name>
      <description>CC1P</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC1NEN</name>
      <description>CC1NEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC1NP</name>
      <description>CC1NP</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC2EN</name>
      <description>CC2EN</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC2P</name>
      <description>CC2P</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC2NEN</name>
      <description>CC2NEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC2NP</name>
      <description>CC2NP</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC3EN</name>
      <description>CC3EN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC3P</name>
      <description>CC3P</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC3NEN</name>
      <description>CC3NEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC3NP</name>
      <description>CC3NP</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC4EN</name>
      <description>CC4EN</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC4P</name>
      <description>CC4P</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC5EN</name>
      <description>CC5EN</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC5P</name>
      <description>CC5P</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC6EN</name>
      <description>CC6EN</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CC6P</name>
      <description>CC6P</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_CNT</name>
  <displayName>TIMx_CNT</displayName>
  <description>TIMx_CNT</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CNT</name>
      <description>CNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_PSC</name>
  <displayName>TIMx_PSC</displayName>
  <description>TIMx_PSC</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>PSC</name>
      <description>PSC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_AR</name>
  <displayName>TIMx_AR</displayName>
  <description>TIMx_AR</description>
  <addressOffset>0x2c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>AR</name>
      <description>AR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_REPCNT</name>
  <displayName>TIMx_REPCNT</displayName>
  <description>TIMx_REPCNT</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>REPCNT</name>
      <description>REPCNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_CCDAT1</name>
  <displayName>TIMx_CCDAT1</displayName>
  <description>TIMx_CCDAT1</description>
  <addressOffset>0x34</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CCDAT1</name>
      <description>CCDAT1</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_CCDAT2</name>
  <displayName>TIMx_CCDAT2</displayName>
  <description>TIMx_CCDAT2</description>
  <addressOffset>0x38</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CCDAT2</name>
      <description>CCDAT2</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TIMx_CCDAT3</name>
  <displayName>TIMx_CCDAT3</displayName>
  <description>TIMx_CCDAT3</description>
  <addressOffset>0x3c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CCDAT3</name>
      <description>CCDAT3</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
