Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G457.svd
</registers>

</peripheral>
<peripheral derivedFrom="TIM6">
    <name>TIM7</name>
    <baseAddress>0x40001400</baseAddress>
    <interrupt>
        <name>TIM7</name>
        <description>TIM7 global interrupt</description>
        <value>55</value>
    </interrupt>
</peripheral>

<peripheral>
    <name>CAN1</name>
    <description>Controller area network</description>
    <groupName>CAN</groupName>
    <baseAddress>0x40006400</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>CAN1_TX</name>
        <description>CAN1 TX interrupts</description>
        <value>19</value>
    </interrupt>
    <interrupt>
        <name>CAN1_RX0</name>
        <description>CAN1 RX0 interrupts</description>
        <value>20</value>
    </interrupt>
    <interrupt>
        <name>CAN1_RX1</name>
        <description>CAN1 RX1 interrupts</description>
        <value>21</value>
    </interrupt>
    <interrupt>
        <name>CAN1_SCE</name>
        <description>CAN1 SCE interrupt</description>
        <value>22</value>
    </interrupt>
    <registers>
<register>
  <name>CAN_MCTRL</name>
  <displayName>CAN_MCTRL</displayName>
  <description>CAN_MCTRL</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00010002</resetValue>
  <resetMask>0x000180ff</resetMask>
  <fields>
    <field>
      <name>INIRQ</name>
      <description>INIRQ</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SLPRQ</name>
      <description>SLPRQ</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXFP</name>
      <description>TXFP</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RFLM</name>
      <description>RFLM</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>NART</name>
      <description>NART</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AWKUM</name>
      <description>AWKUM</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ABOM</name>
      <description>ABOM</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TTCM</name>
      <description>TTCM</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MRST</name>
      <description>MRST</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DBGF</name>
      <description>DBGF</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_MSTS</name>
  <displayName>CAN_MSTS</displayName>
  <description>CAN_MSTS</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000c02</resetValue>
  <resetMask>0x00000f1f</resetMask>
  <fields>
    <field>
      <name>INIAK</name>
      <description>INIAK</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SLPAK</name>
      <description>SLPAK</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRINT</name>
      <description>ERRINT</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WKUINT</name>
      <description>WKUINT</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SLAKINT</name>
      <description>SLAKINT</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXMD</name>
      <description>TXMD</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXMD</name>
      <description>RXMD</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSMP</name>
      <description>LSMP</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXS</name>
      <description>RXS</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TSTS</name>
  <displayName>CAN_TSTS</displayName>
  <description>CAN_TSTS</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x1c000000</resetValue>
  <resetMask>0xff8f8f8f</resetMask>
  <fields>
    <field>
      <name>RQCPM0</name>
      <description>RQCPM0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXOKM0</name>
      <description>TXOKM0</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ALSTM0</name>
      <description>ALSTM0</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TERRM0</name>
      <description>TERRM0</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ABRQM0</name>
      <description>ABRQM0</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RQCPM1</name>
      <description>RQCPM1</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXOKM1</name>
      <description>TXOKM1</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ALSTM1</name>
      <description>ALSTM1</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TERRM1</name>
      <description>TERRM1</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ABRQM1</name>
      <description>ABRQM1</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RQCPM2</name>
      <description>RQCPM2</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXOKM2</name>
      <description>TXOKM2</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ALSTM2</name>
      <description>ALSTM2</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TERRM2</name>
      <description>TERRM2</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ABRQM2</name>
      <description>ABRQM2</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CODE</name>
      <description>CODE</description>
      <bitOffset>24</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>TMEM</name>
      <description>TMEM</description>
      <bitOffset>26</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>LOWM</name>
      <description>LOWM</description>
      <bitOffset>29</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_RFF0</name>
  <displayName>CAN_RFF0</displayName>
  <description>CAN_RFF0</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003b</resetMask>
  <fields>
    <field>
      <name>FFMP0</name>
      <description>FFMP0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>FFULL0</name>
      <description>FFULL0</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FFOVR0</name>
      <description>FFOVR0</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RFFOM0</name>
      <description>RFFOM0</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_RFF1</name>
  <displayName>CAN_RFF1</displayName>
  <description>CAN_RFF1</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003b</resetMask>
  <fields>
    <field>
      <name>FFMP1</name>
      <description>FFMP1</description>
      <bitOffset>0</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>FFULL1</name>
      <description>FFULL1</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FFOVR1</name>
      <description>FFOVR1</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RFFOM1</name>
      <description>RFFOM1</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_INTE</name>
  <displayName>CAN_INTE</displayName>
  <description>CAN_INTE</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00038f7f</resetMask>
  <fields>
    <field>
      <name>TMEITE</name>
      <description>TMEITE</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FMPITE0</name>
      <description>FMPITE0</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FFITE0</name>
      <description>FFITE0</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FOVITE0</name>
      <description>FOVITE0</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FMPITE1</name>
      <description>FMPITE1</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FFITE1</name>
      <description>FFITE1</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FOVITE1</name>
      <description>FOVITE1</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EWGITE</name>
      <description>EWGITE</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EPVITE</name>
      <description>EPVITE</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BOFITE</name>
      <description>BOFITE</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LECITE</name>
      <description>LECITE</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRITE</name>
      <description>ERRITE</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WKUITE</name>
      <description>WKUITE</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SLKITE</name>
      <description>SLKITE</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_ESTS</name>
  <displayName>CAN_ESTS</displayName>
  <description>CAN_ESTS</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffff0077</resetMask>
  <fields>
    <field>
      <name>EWGFL</name>
      <description>EWGFL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EPVFL</name>
      <description>EPVFL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BOFFL</name>
      <description>BOFFL</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LEC</name>
      <description>LEC</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>TXEC</name>
      <description>TXEC</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>RXEC</name>
      <description>RXEC</description>
      <bitOffset>24</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_BTIM</name>
  <displayName>CAN_BTIM</displayName>
  <description>CAN_BTIM</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00230000</resetValue>
  <resetMask>0xc37f03ff</resetMask>
  <fields>
    <field>
      <name>BRTP</name>
      <description>BRTP</description>
      <bitOffset>0</bitOffset>
      <bitWidth>10</bitWidth>
    </field>
    <field>
      <name>TBS1</name>
      <description>TBS1</description>
      <bitOffset>16</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>TBS2</name>
      <description>TBS2</description>
      <bitOffset>20</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>RSJW</name>
      <description>RSJW</description>
      <bitOffset>24</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>LBM</name>
      <description>LBM</description>
      <bitOffset>30</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SLM</name>
      <description>SLM</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TMI0</name>
  <displayName>CAN_TMI0</displayName>
  <description>CAN_TMI0</description>
  <addressOffset>0x180</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>TXRQ</name>
      <description>TXRQ</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RTRQ</name>
      <description>RTRQ</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IDE</name>
      <description>IDE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EXTID</name>
      <description>EXTID</description>
      <bitOffset>3</bitOffset>
      <bitWidth>18</bitWidth>
    </field>
    <field>
      <name>STDID</name>
      <description>STDID</description>
      <bitOffset>21</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TMDT0</name>
  <displayName>CAN_TMDT0</displayName>
  <description>CAN_TMDT0</description>
  <addressOffset>0x184</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffff010f</resetMask>
  <fields>
    <field>
      <name>DLC</name>
      <description>DLC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>TGT</name>
      <description>TGT</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MTIM</name>
      <description>MTIM</description>
      <bitOffset>16</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TMDL0</name>
  <displayName>CAN_TMDL0</displayName>
  <description>CAN_TMDL0</description>
  <addressOffset>0x188</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DATA0</name>
      <description>DATA0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA1</name>
      <description>DATA1</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA2</name>
      <description>DATA2</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA3</name>
      <description>DATA3</description>
      <bitOffset>24</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TMDH0</name>
  <displayName>CAN_TMDH0</displayName>
  <description>CAN_TMDH0</description>
  <addressOffset>0x18c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DATA4</name>
      <description>DATA4</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA5</name>
      <description>DATA5</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA6</name>
      <description>DATA6</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA7</name>
      <description>DATA7</description>
      <bitOffset>24</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TMI1</name>
  <displayName>CAN_TMI1</displayName>
  <description>CAN_TMI1</description>
  <addressOffset>0x190</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>TXRQ</name>
      <description>TXRQ</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RTRQ</name>
      <description>RTRQ</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IDE</name>
      <description>IDE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EXTID</name>
      <description>EXTID</description>
      <bitOffset>3</bitOffset>
      <bitWidth>18</bitWidth>
    </field>
    <field>
      <name>STDID</name>
      <description>STDID</description>
      <bitOffset>21</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TMDT1</name>
  <displayName>CAN_TMDT1</displayName>
  <description>CAN_TMDT1</description>
  <addressOffset>0x194</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffff010f</resetMask>
  <fields>
    <field>
      <name>DLC</name>
      <description>DLC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>TGT</name>
      <description>TGT</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MTIM</name>
      <description>MTIM</description>
      <bitOffset>16</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TMDL1</name>
  <displayName>CAN_TMDL1</displayName>
  <description>CAN_TMDL1</description>
  <addressOffset>0x198</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DATA0</name>
      <description>DATA0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA1</name>
      <description>DATA1</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA2</name>
      <description>DATA2</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA3</name>
      <description>DATA3</description>
      <bitOffset>24</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TMDH1</name>
  <displayName>CAN_TMDH1</displayName>
  <description>CAN_TMDH1</description>
  <addressOffset>0x19c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DATA4</name>
      <description>DATA4</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA5</name>
      <description>DATA5</description>
      <bitOffset>8</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA6</name>
      <description>DATA6</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>DATA7</name>
      <description>DATA7</description>
      <bitOffset>24</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TMI2</name>
  <displayName>CAN_TMI2</displayName>
  <description>CAN_TMI2</description>
  <addressOffset>0x1a0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>TXRQ</name>
      <description>TXRQ</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RTRQ</name>
      <description>RTRQ</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IDE</name>
      <description>IDE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EXTID</name>
      <description>EXTID</description>
      <bitOffset>3</bitOffset>
      <bitWidth>18</bitWidth>
    </field>
    <field>
      <name>STDID</name>
      <description>STDID</description>
      <bitOffset>21</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>CAN_TMDT2</name>
  <displayName>CAN_TMDT2</displayName>
  <description>CAN_TMDT2</description>
  <addressOffset>0x1a4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffff010f</resetMask>
  <fields>
    <field>
      <name>DLC</name>
      <description>DLC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>TGT</name>
      <description>TGT</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MTIM</name>
      <description>MTIM</description>
      <bitOffset>16</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
