Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G457.svd
<register>
  <name>DMA_PADDR3</name>
  <displayName>DMA_PADDR3</displayName>
  <description>DMA_PADDR3</description>
  <addressOffset>0x38</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_MADDR3</name>
  <displayName>DMA_MADDR3</displayName>
  <description>DMA_MADDR3</description>
  <addressOffset>0x3c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHSEL3</name>
  <displayName>DMA_CHSEL3</displayName>
  <description>DMA_CHSEL3</description>
  <addressOffset>0x40</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>CH_SEL</name>
      <description>CH_SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHCFG4</name>
  <displayName>DMA_CHCFG4</displayName>
  <description>DMA_CHCFG4</description>
  <addressOffset>0x44</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00007fff</resetMask>
  <fields>
    <field>
      <name>CHEN</name>
      <description>CHEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCIE</name>
      <description>TXCIE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXIE</name>
      <description>HTXIE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRIE</name>
      <description>ERRIE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DIR</name>
      <description>DIR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CIRC</name>
      <description>CIRC</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PINC</name>
      <description>PINC</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MINC</name>
      <description>MINC</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PSIZE</name>
      <description>PSIZE</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MSIZE</name>
      <description>MSIZE</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PRIOLVL</name>
      <description>PRIOLVL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MEM2MEM</name>
      <description>MEM2MEM</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_TXNUM4</name>
  <displayName>DMA_TXNUM4</displayName>
  <description>DMA_TXNUM4</description>
  <addressOffset>0x48</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>NDTX</name>
      <description>NDTX</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_PADDR4</name>
  <displayName>DMA_PADDR4</displayName>
  <description>DMA_PADDR4</description>
  <addressOffset>0x4c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_MADDR4</name>
  <displayName>DMA_MADDR4</displayName>
  <description>DMA_MADDR4</description>
  <addressOffset>0x50</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHSEL4</name>
  <displayName>DMA_CHSEL4</displayName>
  <description>DMA_CHSEL4</description>
  <addressOffset>0x54</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>CH_SEL</name>
      <description>CH_SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHCFG5</name>
  <displayName>DMA_CHCFG5</displayName>
  <description>DMA_CHCFG5</description>
  <addressOffset>0x58</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00007fff</resetMask>
  <fields>
    <field>
      <name>CHEN</name>
      <description>CHEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCIE</name>
      <description>TXCIE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXIE</name>
      <description>HTXIE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRIE</name>
      <description>ERRIE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DIR</name>
      <description>DIR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CIRC</name>
      <description>CIRC</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PINC</name>
      <description>PINC</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MINC</name>
      <description>MINC</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PSIZE</name>
      <description>PSIZE</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MSIZE</name>
      <description>MSIZE</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PRIOLVL</name>
      <description>PRIOLVL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MEM2MEM</name>
      <description>MEM2MEM</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_TXNUM5</name>
  <displayName>DMA_TXNUM5</displayName>
  <description>DMA_TXNUM5</description>
  <addressOffset>0x5c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>NDTX</name>
      <description>NDTX</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_PADDR5</name>
  <displayName>DMA_PADDR5</displayName>
  <description>DMA_PADDR5</description>
  <addressOffset>0x60</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_MADDR5</name>
  <displayName>DMA_MADDR5</displayName>
  <description>DMA_MADDR5</description>
  <addressOffset>0x64</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHSEL5</name>
  <displayName>DMA_CHSEL5</displayName>
  <description>DMA_CHSEL5</description>
  <addressOffset>0x68</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>CH_SEL</name>
      <description>CH_SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHCFG6</name>
  <displayName>DMA_CHCFG6</displayName>
  <description>DMA_CHCFG6</description>
  <addressOffset>0x6c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00007fff</resetMask>
  <fields>
    <field>
      <name>CHEN</name>
      <description>CHEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCIE</name>
      <description>TXCIE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXIE</name>
      <description>HTXIE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRIE</name>
      <description>ERRIE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DIR</name>
      <description>DIR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CIRC</name>
      <description>CIRC</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PINC</name>
      <description>PINC</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MINC</name>
      <description>MINC</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PSIZE</name>
      <description>PSIZE</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MSIZE</name>
      <description>MSIZE</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PRIOLVL</name>
      <description>PRIOLVL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MEM2MEM</name>
      <description>MEM2MEM</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_TXNUM6</name>
  <displayName>DMA_TXNUM6</displayName>
  <description>DMA_TXNUM6</description>
  <addressOffset>0x70</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>NDTX</name>
      <description>NDTX</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_PADDR6</name>
  <displayName>DMA_PADDR6</displayName>
  <description>DMA_PADDR6</description>
  <addressOffset>0x74</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_MADDR6</name>
  <displayName>DMA_MADDR6</displayName>
  <description>DMA_MADDR6</description>
  <addressOffset>0x78</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHSEL6</name>
  <displayName>DMA_CHSEL6</displayName>
  <description>DMA_CHSEL6</description>
  <addressOffset>0x7c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>CH_SEL</name>
      <description>CH_SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHCFG7</name>
  <displayName>DMA_CHCFG7</displayName>
  <description>DMA_CHCFG7</description>
  <addressOffset>0x80</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00007fff</resetMask>
  <fields>
    <field>
      <name>CHEN</name>
      <description>CHEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCIE</name>
      <description>TXCIE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXIE</name>
      <description>HTXIE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRIE</name>
      <description>ERRIE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DIR</name>
      <description>DIR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CIRC</name>
      <description>CIRC</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PINC</name>
      <description>PINC</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MINC</name>
      <description>MINC</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PSIZE</name>
      <description>PSIZE</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MSIZE</name>
      <description>MSIZE</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PRIOLVL</name>
      <description>PRIOLVL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MEM2MEM</name>
      <description>MEM2MEM</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_TXNUM7</name>
  <displayName>DMA_TXNUM7</displayName>
  <description>DMA_TXNUM7</description>
  <addressOffset>0x84</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>NDTX</name>
      <description>NDTX</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_PADDR7</name>
  <displayName>DMA_PADDR7</displayName>
  <description>DMA_PADDR7</description>
  <addressOffset>0x88</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_MADDR7</name>
  <displayName>DMA_MADDR7</displayName>
  <description>DMA_MADDR7</description>
  <addressOffset>0x8c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHSEL7</name>
  <displayName>DMA_CHSEL7</displayName>
  <description>DMA_CHSEL7</description>
  <addressOffset>0x90</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>CH_SEL</name>
      <description>CH_SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHCFG8</name>
  <displayName>DMA_CHCFG8</displayName>
  <description>DMA_CHCFG8</description>
  <addressOffset>0x94</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00007fff</resetMask>
  <fields>
    <field>
      <name>CHEN</name>
      <description>CHEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXCIE</name>
      <description>TXCIE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HTXIE</name>
      <description>HTXIE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRIE</name>
      <description>ERRIE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DIR</name>
      <description>DIR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CIRC</name>
      <description>CIRC</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PINC</name>
      <description>PINC</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MINC</name>
      <description>MINC</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PSIZE</name>
      <description>PSIZE</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MSIZE</name>
      <description>MSIZE</description>
      <bitOffset>10</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PRIOLVL</name>
      <description>PRIOLVL</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MEM2MEM</name>
      <description>MEM2MEM</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_TXNUM8</name>
  <displayName>DMA_TXNUM8</displayName>
  <description>DMA_TXNUM8</description>
  <addressOffset>0x98</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>NDTX</name>
      <description>NDTX</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_PADDR8</name>
  <displayName>DMA_PADDR8</displayName>
  <description>DMA_PADDR8</description>
  <addressOffset>0x9c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_MADDR8</name>
  <displayName>DMA_MADDR8</displayName>
  <description>DMA_MADDR8</description>
  <addressOffset>0xa0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHSEL8</name>
  <displayName>DMA_CHSEL8</displayName>
  <description>DMA_CHSEL8</description>
  <addressOffset>0xa4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>CH_SEL</name>
      <description>CH_SEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>DMA_CHMAPEN</name>
  <displayName>DMA_CHMAPEN</displayName>
  <description>DMA_CHMAPEN</description>
  <addressOffset>0xa8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>MAP_EN</name>
      <description>MAP_EN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
