Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G457.svd
</registers>

</peripheral>

<peripheral>
    <name>FLASH</name>
    <description>interal FLASH controller</description>
    <groupName>FLASH</groupName>
    <baseAddress>0x40022000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x38</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>FLASH</name>
        <description>FLASH interrupt</description>
        <value>4</value>
    </interrupt>
                <registers>
<register>
  <name>FLASH_AC</name>
  <displayName>FLASH_AC</displayName>
  <description>FLASH_AC</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000030</resetValue>
  <resetMask>0x000000f7</resetMask>
  <fields>
    <field>
      <name>LATENCY</name>
      <description>LATENCY</description>
      <bitOffset>0</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>PRFTBFE</name>
      <description>PRFTBFE</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PRFTBFS</name>
      <description>PRFTBFS</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ICAHRST</name>
      <description>ICAHRST</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ICAHEN</name>
      <description>ICAHEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>FLASH_KEY</name>
  <displayName>FLASH_KEY</displayName>
  <description>FLASH_KEY</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FKEY</name>
      <description>FKEY</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>FLASH_OPTKEY</name>
  <displayName>FLASH_OPTKEY</displayName>
  <description>FLASH_OPTKEY</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>OPTKEY</name>
      <description>OPTKEY</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>FLASH_STS</name>
  <displayName>FLASH_STS</displayName>
  <description>FLASH_STS</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>BUSY</name>
      <description>BUSY</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RDKEYERR</name>
      <description>RDKEYERR</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PGERR</name>
      <description>PGERR</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PVERR</name>
      <description>PVERR</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WRPERR</name>
      <description>WRPERR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EOP</name>
      <description>EOP</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EVERR</name>
      <description>EVERR</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ECCERR</name>
      <description>ECCERR</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>FLASH_CTRL</name>
  <displayName>FLASH_CTRL</displayName>
  <description>FLASH_CTRL</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000080</resetValue>
  <resetMask>0x00003ff7</resetMask>
  <fields>
    <field>
      <name>PG</name>
      <description>PG</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PER</name>
      <description>PER</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MER</name>
      <description>MER</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OPTPG</name>
      <description>OPTPG</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OPTER</name>
      <description>OPTER</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>START</name>
      <description>START</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LOCK</name>
      <description>LOCK</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SMPSEL</name>
      <description>SMPSEL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OPTWE</name>
      <description>OPTWE</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRITE</name>
      <description>ERRITE</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FERRITE</name>
      <description>FERRITE</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EOPITE</name>
      <description>EOPITE</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ECCERRITE</name>
      <description>ECCERRITE</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>FLASH_ADD</name>
  <displayName>FLASH_ADD</displayName>
  <description>FLASH_ADD</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>FADD</name>
      <description>FADD</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>FLASH_OB</name>
  <displayName>FLASH_OB</displayName>
  <description>FLASH_OB</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x03fffffc</resetValue>
  <resetMask>0x83ffffff</resetMask>
  <fields>
    <field>
      <name>OBERR</name>
      <description>OBERR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RDPRT1</name>
      <description>RDPRT1</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WDG_SW</name>
      <description>WDG_SW</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>nRST_STOP0</name>
      <description>nRST_STOP0</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>nRST_STDBY</name>
      <description>nRST_STDBY</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>Not_Used</name>
      <description>Not_Used</description>
      <bitOffset>5</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>Data0</name>
      <description>Data0</description>
      <bitOffset>10</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>Data1</name>
      <description>Data1</description>
      <bitOffset>18</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>RDPRT2</name>
      <description>RDPRT2</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>FLASH_WRP</name>
  <displayName>FLASH_WRP</displayName>
  <description>FLASH_WRP</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0xffffffff</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>WRPT</name>
      <description>WRPT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>FLASH_ECCR</name>
  <displayName>FLASH_ECCR</displayName>
  <description>FLASH_ECCR</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00003f3f</resetMask>
  <fields>
    <field>
      <name>ECCLW</name>
      <description>ECCLW</description>
      <bitOffset>0</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
    <field>
      <name>ECCHW</name>
      <description>ECCHW</description>
      <bitOffset>8</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>FLASH_RDN</name>
  <displayName>FLASH_RDN</displayName>
  <description>FLASH_RDN</description>
  <addressOffset>0x2c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x01ff01ff</resetMask>
  <fields>
    <field>
      <name>FLASH_RDN0</name>
      <description>FLASH_RDN0</description>
      <bitOffset>0</bitOffset>
      <bitWidth>9</bitWidth>
    </field>
    <field>
      <name>FLASH_RDN1</name>
      <description>FLASH_RDN1</description>
      <bitOffset>16</bitOffset>
      <bitWidth>9</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>FLASH_CAHR</name>
  <displayName>FLASH_CAHR</displayName>
  <description>FLASH_CAHR</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>LOCKSTRT</name>
      <description>LOCKSTRT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>LOCKSTOP</name>
      <description>LOCKSTOP</description>
      <bitOffset>4</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
  </fields>
</register>
