Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G457.svd
</registers>

</peripheral>

<peripheral>
    <name>RTC</name>
    <description>Real time clock</description>
    <groupName>RTC</groupName>
    <baseAddress>0x40002800</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>RTC</name>
        <description>RTC global interrupt</description>
        <value>3</value>
    </interrupt>
    <interrupt>
        <name>RTCAlarm</name>
        <description>RTC Alarms through EXTI line interrupt</description>
        <value>41</value>
    </interrupt>
    <registers>
<register>
  <name>RTC_TSH</name>
  <displayName>RTC_TSH</displayName>
  <description>RTC_TSH</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x007f7f7f</resetMask>
  <fields>
    <field>
      <name>SCU</name>
      <description>SCU</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>SCT</name>
      <description>SCT</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>MIU</name>
      <description>MIU</description>
      <bitOffset>8</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>MIT</name>
      <description>MIT</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>HOU</name>
      <description>HOU</description>
      <bitOffset>16</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>HOT</name>
      <description>HOT</description>
      <bitOffset>20</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>APM</name>
      <description>APM</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_DATE</name>
  <displayName>RTC_DATE</displayName>
  <description>RTC_DATE</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00002101</resetValue>
  <resetMask>0x00ffff3f</resetMask>
  <fields>
    <field>
      <name>DAU</name>
      <description>DAU</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MOU</name>
      <description>MOU</description>
      <bitOffset>8</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>MOT</name>
      <description>MOT</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WDU</name>
      <description>WDU</description>
      <bitOffset>13</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>YRU</name>
      <description>YRU</description>
      <bitOffset>16</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>YRT</name>
      <description>YRT</description>
      <bitOffset>20</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_CTRL</name>
  <displayName>RTC_CTRL</displayName>
  <description>RTC_CTRL</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00ff7f67</resetMask>
  <fields>
    <field>
      <name>WKUPSEL</name>
      <description>WKUPSEL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
	<field>
      <name>TSPOL</name>
      <description>TSPOL</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BYPS</name>
      <description>BYPS</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HFMT</name>
      <description>HFMT</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ALAEN</name>
      <description>ALAEN</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ALBEN</name>
      <description>ALBEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WTEN</name>
      <description>WTEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSEN</name>
      <description>TSEN</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ALAIEN</name>
      <description>ALAIEN</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ALBIEN</name>
      <description>ALBIEN</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WTIEN</name>
      <description>WTIEN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AD1H</name>
      <description>AD1H</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SU1H</name>
      <description>SU1H</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BAKP</name>
      <description>BAKP</description>
      <bitOffset>18</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CALOSEL</name>
      <description>CALOSEL</description>
      <bitOffset>19</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OPOL</name>
      <description>OPOL</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OUTSEL</name>
      <description>OUTSEL</description>
      <bitOffset>21</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>COEN</name>
      <description>COEN</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_INITSTS</name>
  <displayName>RTC_INITSTS</displayName>
  <description>RTC_INITSTS</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000007</resetValue>
  <resetMask>0x00011fff</resetMask>
  <fields>
    <field>
      <name>ALAWF</name>
      <description>ALAWF</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ALBWF</name>
      <description>ALBWF</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WTWF</name>
      <description>WTWF</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SHOPF</name>
      <description>SHOPF</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INITSF</name>
      <description>INITSF</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RSYF</name>
      <description>RSYF</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INITF</name>
      <description>INITF</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>INITM</name>
      <description>INITM</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ALAF</name>
      <description>ALAF</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ALBF</name>
      <description>ALBF</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WTF</name>
      <description>WTF</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TISF</name>
      <description>TISF</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TISOVF</name>
      <description>TISOVF</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RECPF</name>
      <description>RECPF</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_PRE</name>
  <displayName>RTC_PRE</displayName>
  <description>RTC_PRE</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x007f00ff</resetValue>
  <resetMask>0x007f7fff</resetMask>
  <fields>
    <field>
      <name>DIVS</name>
      <description>DIVS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>15</bitWidth>
    </field>
    <field>
      <name>DIVA</name>
      <description>DIVA</description>
      <bitOffset>16</bitOffset>
      <bitWidth>7</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_WKUPT</name>
  <displayName>RTC_WKUPT</displayName>
  <description>RTC_WKUPT</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x0000ffff</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>WKUPT</name>
      <description>WKUPT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_ALARMA</name>
  <displayName>RTC_ALARMA</displayName>
  <description>RTC_ALARMA</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>SEU</name>
      <description>SEU</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>SET</name>
      <description>SET</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>MASK1</name>
      <description>MASK1</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MIU</name>
      <description>MIU</description>
      <bitOffset>8</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>MIT</name>
      <description>MIT</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>MASK2</name>
      <description>MASK2</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HOU</name>
      <description>HOU</description>
      <bitOffset>16</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>HOT</name>
      <description>HOT</description>
      <bitOffset>20</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>APM</name>
      <description>APM</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MASK3</name>
      <description>MASK3</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DTU</name>
      <description>DTU</description>
      <bitOffset>24</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>DTT</name>
      <description>DTT</description>
      <bitOffset>28</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>WKDSEL</name>
      <description>WKDSEL</description>
      <bitOffset>30</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MASK4</name>
      <description>MASK4</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_ALARMB</name>
  <displayName>RTC_ALARMB</displayName>
  <description>RTC_ALARMB</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>SEU</name>
      <description>SEU</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>SET</name>
      <description>SET</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>MASK1</name>
      <description>MASK1</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MIU</name>
      <description>MIU</description>
      <bitOffset>8</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>MIT</name>
      <description>MIT</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>MASK2</name>
      <description>MASK2</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HOU</name>
      <description>HOU</description>
      <bitOffset>16</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>HOT</name>
      <description>HOT</description>
      <bitOffset>20</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>APM</name>
      <description>APM</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MASK3</name>
      <description>MASK3</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DTU</name>
      <description>DTU</description>
      <bitOffset>24</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>DTT</name>
      <description>DTT</description>
      <bitOffset>28</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>WKDSEL</name>
      <description>WKDSEL</description>
      <bitOffset>30</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MASK4</name>
      <description>MASK4</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_WRP</name>
  <displayName>RTC_WRP</displayName>
  <description>RTC_WRP</description>
  <addressOffset>0x24</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>PKEY</name>
      <description>PKEY</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_SUBS</name>
  <displayName>RTC_SUBS</displayName>
  <description>RTC_SUBS</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>SS</name>
      <description>SS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_SCTRL</name>
  <displayName>RTC_SCTRL</displayName>
  <description>RTC_SCTRL</description>
  <addressOffset>0x2c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x80007fff</resetMask>
  <fields>
    <field>
      <name>ADFS</name>
      <description>ADFS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>15</bitWidth>
    </field>
    <field>
      <name>SUB1S</name>
      <description>SUB1S</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_TST</name>
  <displayName>RTC_TST</displayName>
  <description>RTC_TST</description>
  <addressOffset>0x30</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000007f</resetMask>
  <fields>
    <field>
      <name>SEU</name>
      <description>SEU</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>SET</name>
      <description>SET</description>
      <bitOffset>4</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>MIU</name>
      <description>MIU</description>
      <bitOffset>8</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>MIT</name>
      <description>MIT</description>
      <bitOffset>12</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>HOU</name>
      <description>HOU</description>
      <bitOffset>16</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>HOT</name>
      <description>HOT</description>
      <bitOffset>20</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>APM</name>
      <description>APM</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_TSD</name>
  <displayName>RTC_TSD</displayName>
  <description>RTC_TSD</description>
  <addressOffset>0x34</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00ffff3f</resetMask>
  <fields>
    <field>
      <name>DAU</name>
      <description>DAU</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>MOU</name>
      <description>MOU</description>
      <bitOffset>8</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>MOT</name>
      <description>MOT</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WDU</name>
      <description>WDU</description>
      <bitOffset>13</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>YRU</name>
      <description>YRU</description>
      <bitOffset>16</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>YRT</name>
      <description>YRT</description>
      <bitOffset>20</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_TSSS</name>
  <displayName>RTC_TSSS</displayName>
  <description>RTC_TSSS</description>
  <addressOffset>0x38</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>SSE</name>
      <description>SSE</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_CALIB</name>
  <displayName>RTC_CALIB</displayName>
  <description>RTC_CALIB</description>
  <addressOffset>0x3c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>CM</name>
      <description>CM</description>
      <bitOffset>0</bitOffset>
      <bitWidth>9</bitWidth>
    </field>
    <field>
      <name>CW16</name>
      <description>CW16</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CW8</name>
      <description>CW8</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CP</name>
      <description>CP</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_ALRMASS</name>
  <displayName>RTC_ALRMASS</displayName>
  <description>RTC_ALRMASS</description>
  <addressOffset>0x44</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0f007fff</resetMask>
  <fields>
    <field>
      <name>SSV</name>
      <description>SSV</description>
      <bitOffset>0</bitOffset>
      <bitWidth>15</bitWidth>
    </field>
    <field>
      <name>MASKSSB</name>
      <description>MASKSSB</description>
      <bitOffset>24</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_ALRMBSS</name>
  <displayName>RTC_ALRMBSS</displayName>
  <description>RTC_ALRMBSS</description>
  <addressOffset>0x48</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0f007fff</resetMask>
  <fields>
    <field>
      <name>SSV</name>
      <description>SSV</description>
      <bitOffset>0</bitOffset>
      <bitWidth>15</bitWidth>
    </field>
    <field>
      <name>MASKSSB</name>
      <description>MASKSSB</description>
      <bitOffset>24</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_OPT</name>
  <displayName>RTC_OPT</displayName>
  <description>RTC_OPT</description>
  <addressOffset>0x4c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000001</resetMask>
  <fields>
    <field>
      <name>TYPE</name>
      <description>TYPE</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_TSCWKUPCTRL</name>
  <displayName>RTC_TSCWKUPCTRL</displayName>
  <description>RTC_TSCWKUPCTRL</description>
  <addressOffset>0x64</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000008</resetValue>
  <resetMask>0x0000000d</resetMask>
  <fields>
    <field>
      <name>WKUPEN</name>
      <description>WKUPEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WKUPCNF</name>
      <description>WKUPCNF</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WKUPOFF</name>
      <description>WKUPOFF</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>RTC_TSCWKUPCNT</name>
  <displayName>RTC_TSCWKUPCNT</displayName>
  <description>RTC_TSCWKUPCNT</description>
  <addressOffset>0x68</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x000002fe</resetValue>
  <resetMask>0x00003fff</resetMask>
  <fields>
    <field>
      <name>CNT</name>
      <description>CNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>14</bitWidth>
    </field>
  </fields>
</register>
