Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G457.svd
</registers>

</peripheral>
<peripheral>
    <name>SPI3</name>
    <description>Serial peripheral interface</description>
    <groupName>SPI</groupName>
    <baseAddress>0x40003C00</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>SPI3</name>
        <description>SPI3 global interrupt</description>
        <value>51</value>
    </interrupt>
    <registers>
<register>
  <name>SPI_CTRL1</name>
  <displayName>SPI_CTRL1</displayName>
  <description>SPI_CTRL1</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CLKPHA</name>
      <description>CLKPHA</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CLKPOL</name>
      <description>CLKPOL</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MSEL_</name>
      <description>MSEL_</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BR</name>
      <description>BR</description>
      <bitOffset>3</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>SPIEN</name>
      <description>SPIEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LSBFF_</name>
      <description>LSBFF_</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SSEL</name>
      <description>SSEL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SSMEN</name>
      <description>SSMEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RONLY</name>
      <description>RONLY</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DATFF</name>
      <description>DATFF</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CRCNEXT</name>
      <description>CRCNEXT</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CRCEN</name>
      <description>CRCEN</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BIDIROEN</name>
      <description>BIDIROEN</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BIDIRMODE</name>
      <description>BIDIRMODE</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SPI_CTRL2</name>
  <displayName>SPI_CTRL2</displayName>
  <description>SPI_CTRL2</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000e7</resetMask>
  <fields>
    <field>
      <name>RDMAEN</name>
      <description>RDMAEN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TDMAEN</name>
      <description>TDMAEN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SSOEN_</name>
      <description>SSOEN_</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRINTEN__</name>
      <description>ERRINTEN__</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RNEINTEN</name>
      <description>RNEINTEN</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TEINTEN</name>
      <description>TEINTEN</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SPI_STS</name>
  <displayName>SPI_STS</displayName>
  <description>SPI_STS</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000002</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>RNE</name>
      <description>RNE</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TE</name>
      <description>TE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CHSIDE</name>
      <description>CHSIDE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UNDER</name>
      <description>UNDER</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CRCERR</name>
      <description>CRCERR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MODERR</name>
      <description>MODERR</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OVER</name>
      <description>OVER</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BUSY_</name>
      <description>BUSY_</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SPI_DAT</name>
  <displayName>SPI_DAT</displayName>
  <description>SPI_DAT</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SPI_CRCPOLY</name>
  <displayName>SPI_CRCPOLY</displayName>
  <description>SPI_CRCPOLY</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CRCPOLY</name>
      <description>CRCPOLY</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SPI_CRCRDAT</name>
  <displayName>SPI_CRCRDAT</displayName>
  <description>SPI_CRCRDAT</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CRCRDAT</name>
      <description>CRCRDAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SPI_CRCTDAT</name>
  <displayName>SPI_CRCTDAT</displayName>
  <description>SPI_CRCTDAT</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>CRCTDAT</name>
      <description>CRCTDAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SPI_I2SCFG</name>
  <displayName>SPI_I2SCFG</displayName>
  <description>SPI_I2SCFG</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000fbf</resetMask>
  <fields>
    <field>
      <name>CHBITS</name>
      <description>CHBITS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TDATLEN</name>
      <description>TDATLEN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>CLKPOL</name>
      <description>CLKPOL</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>STDSEL</name>
      <description>STDSEL</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>PCMFSYNC</name>
      <description>PCMFSYNC</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MODCFG</name>
      <description>MODCFG</description>
      <bitOffset>8</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>I2SEN</name>
      <description>I2SEN</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MODSEL</name>
      <description>MODSEL</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>SPI_I2SPREDIV</name>
  <displayName>SPI_I2SPREDIV</displayName>
  <description>SPI_I2SPREDIV</description>
  <addressOffset>0x20</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000002</resetValue>
  <resetMask>0x000003ff</resetMask>
  <fields>
    <field>
      <name>LDIV</name>
      <description>LDIV</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
    <field>
      <name>ODD_EVEN_</name>
      <description>ODD_EVEN_</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MCLKOEN</name>
      <description>MCLKOEN</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
