Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G457.svd
</registers>

</peripheral>
<peripheral derivedFrom="UART4">
    <name>UART5</name>
    <baseAddress>0x40005000</baseAddress>
    <interrupt>
        <name>UART5</name>
        <description>UART5 global interrupt</description>
        <value>53</value>
    </interrupt>
</peripheral>
<peripheral derivedFrom="UART4">
    <name>UART6</name>
    <baseAddress>0x40015000</baseAddress>
    <interrupt>
        <name>UART6</name>
        <description>UART6 global interrupt</description>
        <value>74</value>
    </interrupt>
</peripheral>
<peripheral derivedFrom="UART4">
    <name>UART7</name>
    <baseAddress>0x40015400</baseAddress>
    <interrupt>
        <name>UART7</name>
        <description>UART7 global interrupt</description>
        <value>75</value>
    </interrupt>
</peripheral>

<peripheral>
    <name>USB</name>
    <description>Universal serial bus full-speed device interface</description>
    <groupName>USB</groupName>
    <baseAddress>0x40005C00</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>USBWakeUp</name>
        <description>USB Device WakeUp from suspend through EXTI Line Interrupt</description>
        <value>42</value>
    </interrupt>
    <registers>
<register>
  <name>USB_EP0</name>
  <displayName>USB_EP0</displayName>
  <description>USB_EP0</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>EPADDR</name>
      <description>EPADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>STS_TX</name>
      <description>STS_TX</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_TX</name>
      <description>DATTOG_TX</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_TX</name>
      <description>CTRS_TX</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_KIND</name>
      <description>EP_KIND</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_TYPE</name>
      <description>EP_TYPE</description>
      <bitOffset>9</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SETUP</name>
      <description>SETUP</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>STS_RX</name>
      <description>STS_RX</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_RX</name>
      <description>DATTOG_RX</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_RX</name>
      <description>CTRS_RX</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USB_EP1</name>
  <displayName>USB_EP1</displayName>
  <description>USB_EP1</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>EPADDR</name>
      <description>EPADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>STS_TX</name>
      <description>STS_TX</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_TX</name>
      <description>DATTOG_TX</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_TX</name>
      <description>CTRS_TX</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_KIND</name>
      <description>EP_KIND</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_TYPE</name>
      <description>EP_TYPE</description>
      <bitOffset>9</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SETUP</name>
      <description>SETUP</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>STS_RX</name>
      <description>STS_RX</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_RX</name>
      <description>DATTOG_RX</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_RX</name>
      <description>CTRS_RX</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USB_EP2</name>
  <displayName>USB_EP2</displayName>
  <description>USB_EP2</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>EPADDR</name>
      <description>EPADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>STS_TX</name>
      <description>STS_TX</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_TX</name>
      <description>DATTOG_TX</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_TX</name>
      <description>CTRS_TX</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_KIND</name>
      <description>EP_KIND</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_TYPE</name>
      <description>EP_TYPE</description>
      <bitOffset>9</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SETUP</name>
      <description>SETUP</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>STS_RX</name>
      <description>STS_RX</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_RX</name>
      <description>DATTOG_RX</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_RX</name>
      <description>CTRS_RX</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USB_EP3</name>
  <displayName>USB_EP3</displayName>
  <description>USB_EP3</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>EPADDR</name>
      <description>EPADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>STS_TX</name>
      <description>STS_TX</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_TX</name>
      <description>DATTOG_TX</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_TX</name>
      <description>CTRS_TX</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_KIND</name>
      <description>EP_KIND</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_TYPE</name>
      <description>EP_TYPE</description>
      <bitOffset>9</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SETUP</name>
      <description>SETUP</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>STS_RX</name>
      <description>STS_RX</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_RX</name>
      <description>DATTOG_RX</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_RX</name>
      <description>CTRS_RX</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USB_EP4</name>
  <displayName>USB_EP4</displayName>
  <description>USB_EP4</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>EPADDR</name>
      <description>EPADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>STS_TX</name>
      <description>STS_TX</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_TX</name>
      <description>DATTOG_TX</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_TX</name>
      <description>CTRS_TX</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_KIND</name>
      <description>EP_KIND</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_TYPE</name>
      <description>EP_TYPE</description>
      <bitOffset>9</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SETUP</name>
      <description>SETUP</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>STS_RX</name>
      <description>STS_RX</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_RX</name>
      <description>DATTOG_RX</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_RX</name>
      <description>CTRS_RX</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USB_EP5</name>
  <displayName>USB_EP5</displayName>
  <description>USB_EP5</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>EPADDR</name>
      <description>EPADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>STS_TX</name>
      <description>STS_TX</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_TX</name>
      <description>DATTOG_TX</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_TX</name>
      <description>CTRS_TX</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_KIND</name>
      <description>EP_KIND</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_TYPE</name>
      <description>EP_TYPE</description>
      <bitOffset>9</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SETUP</name>
      <description>SETUP</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>STS_RX</name>
      <description>STS_RX</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_RX</name>
      <description>DATTOG_RX</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_RX</name>
      <description>CTRS_RX</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USB_EP6</name>
  <displayName>USB_EP6</displayName>
  <description>USB_EP6</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>EPADDR</name>
      <description>EPADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>STS_TX</name>
      <description>STS_TX</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_TX</name>
      <description>DATTOG_TX</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_TX</name>
      <description>CTRS_TX</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_KIND</name>
      <description>EP_KIND</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_TYPE</name>
      <description>EP_TYPE</description>
      <bitOffset>9</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SETUP</name>
      <description>SETUP</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>STS_RX</name>
      <description>STS_RX</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_RX</name>
      <description>DATTOG_RX</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_RX</name>
      <description>CTRS_RX</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USB_EP7</name>
  <displayName>USB_EP7</displayName>
  <description>USB_EP7</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>EPADDR</name>
      <description>EPADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>STS_TX</name>
      <description>STS_TX</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_TX</name>
      <description>DATTOG_TX</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_TX</name>
      <description>CTRS_TX</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_KIND</name>
      <description>EP_KIND</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>EP_TYPE</name>
      <description>EP_TYPE</description>
      <bitOffset>9</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SETUP</name>
      <description>SETUP</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>STS_RX</name>
      <description>STS_RX</description>
      <bitOffset>12</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DATTOG_RX</name>
      <description>DATTOG_RX</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS_RX</name>
      <description>CTRS_RX</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USB_CTRL</name>
  <displayName>USB_CTRL</displayName>
  <description>USB_CTRL</description>
  <addressOffset>0x40</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000003</resetValue>
  <resetMask>0x0000ff1f</resetMask>
  <fields>
    <field>
      <name>FRST</name>
      <description>FRST</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PD</name>
      <description>PD</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LP_MODE</name>
      <description>LP_MODE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FSUSPD</name>
      <description>FSUSPD</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RESUM</name>
      <description>RESUM</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ESOFM</name>
      <description>ESOFM</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SOFM</name>
      <description>SOFM</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RSTM</name>
      <description>RSTM</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SUSPDM</name>
      <description>SUSPDM</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WKUPM</name>
      <description>WKUPM</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERRORM</name>
      <description>ERRORM</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PMAOM</name>
      <description>PMAOM</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRSM</name>
      <description>CTRSM</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USB_STS</name>
  <displayName>USB_STS</displayName>
  <description>USB_STS</description>
  <addressOffset>0x44</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ff1f</resetMask>
  <fields>
    <field>
      <name>EP_ID</name>
      <description>EP_ID</description>
      <bitOffset>0</bitOffset>
      <bitWidth>4</bitWidth>
    </field>
    <field>
      <name>DIR</name>
      <description>DIR</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ESOF</name>
      <description>ESOF</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SOF</name>
      <description>SOF</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RST</name>
      <description>RST</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SUSPD</name>
      <description>SUSPD</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WKUP</name>
      <description>WKUP</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERROR</name>
      <description>ERROR</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PMAO</name>
      <description>PMAO</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CTRS</name>
      <description>CTRS</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USB_FN</name>
  <displayName>USB_FN</displayName>
  <description>USB_FN</description>
  <addressOffset>0x48</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>FN</name>
      <description>FN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>LSTSOF</name>
      <description>LSTSOF</description>
      <bitOffset>11</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>LOCK</name>
      <description>LOCK</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXDM_STS</name>
      <description>RXDM_STS</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXDP_STS</name>
      <description>RXDP_STS</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USB_ADDR</name>
  <displayName>USB_ADDR</displayName>
  <description>USB_ADDR</description>
  <addressOffset>0x4c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000007f</resetMask>
  <fields>
    <field>
      <name>ADDR</name>
      <description>ADDR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>7</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>USB_BUFTAB</name>
  <displayName>USB_BUFTAB</displayName>
  <description>USB_BUFTAB</description>
  <addressOffset>0x50</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000fff8</resetMask>
  <fields>
    <field>
      <name>BUFTAB</name>
      <description>BUFTAB</description>
      <bitOffset>3</bitOffset>
      <bitWidth>13</bitWidth>
    </field>
  </fields>
</register>
