Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G457.svd
<register>
  <name>TSC_THRHD17</name>
  <displayName>TSC_THRHD17</displayName>
  <description>TSC_THRHD17</description>
  <addressOffset>0x68</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE17</name>
      <description>BASE17</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA17</name>
      <description>DELTA17</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD18</name>
  <displayName>TSC_THRHD18</displayName>
  <description>TSC_THRHD18</description>
  <addressOffset>0x6c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE18</name>
      <description>BASE18</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA18</name>
      <description>DELTA18</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD19</name>
  <displayName>TSC_THRHD19</displayName>
  <description>TSC_THRHD19</description>
  <addressOffset>0x70</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE19</name>
      <description>BASE19</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA19</name>
      <description>DELTA19</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD20</name>
  <displayName>TSC_THRHD20</displayName>
  <description>TSC_THRHD20</description>
  <addressOffset>0x74</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE20</name>
      <description>BASE20</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA20</name>
      <description>DELTA20</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD21</name>
  <displayName>TSC_THRHD21</displayName>
  <description>TSC_THRHD21</description>
  <addressOffset>0x78</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE21</name>
      <description>BASE21</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA21</name>
      <description>DELTA21</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD22</name>
  <displayName>TSC_THRHD22</displayName>
  <description>TSC_THRHD22</description>
  <addressOffset>0x7c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE22</name>
      <description>BASE22</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA22</name>
      <description>DELTA22</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>TSC_THRHD23</name>
  <displayName>TSC_THRHD23</displayName>
  <description>TSC_THRHD23</description>
  <addressOffset>0x80</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00800400</resetValue>
  <resetMask>0x00ff07ff</resetMask>
  <fields>
    <field>
      <name>BASE23</name>
      <description>BASE23</description>
      <bitOffset>0</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>DELTA23</name>
      <description>DELTA23</description>
      <bitOffset>16</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
</registers>

</peripheral>

<peripheral>
    <name>ETH</name>
    <description>Ethernet: media access control</description>
    <groupName>ETH</groupName>
    <baseAddress>0x40028000</baseAddress>
    <addressBlock>
        <offset>0x0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
    </addressBlock>
    <interrupt>
        <name>ETH</name>
        <description>Ethernet global interrupt</description>
        <value>61</value>
    </interrupt>
    <interrupt>
        <name>ETH_WKUP</name>
        <description>Ethernet Wakeup through EXTI line interrupt</description>
        <value>62</value>
    </interrupt>
                <registers>
<register>
  <name>ETH_MACCFG</name>
  <displayName>ETH_MACCFG</displayName>
  <description>ETH_MACCFG</description>
  <addressOffset>0x0</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00cf7efc</resetMask>
  <fields>
    <field>
      <name>RE</name>
      <description>RE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TE</name>
      <description>TE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DC</name>
      <description>DC</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>BL</name>
      <description>BL</description>
      <bitOffset>5</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>ACS</name>
      <description>ACS</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DR</name>
      <description>DR</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IPC</name>
      <description>IPC</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DM</name>
      <description>DM</description>
      <bitOffset>11</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>LM</name>
      <description>LM</description>
      <bitOffset>12</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DO</name>
      <description>DO</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FES</name>
      <description>FES</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DCRS</name>
      <description>DCRS</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>IFG</name>
      <description>IFG</description>
      <bitOffset>17</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>JD</name>
      <description>JD</description>
      <bitOffset>22</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>WD</name>
      <description>WD</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACFFLT</name>
  <displayName>ETH_MACFFLT</displayName>
  <description>ETH_MACFFLT</description>
  <addressOffset>0x4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x800007ff</resetMask>
  <fields>
    <field>
      <name>PRM</name>
      <description>PRM</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HUC</name>
      <description>HUC</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HMC</name>
      <description>HMC</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DAIF</name>
      <description>DAIF</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PAM</name>
      <description>PAM</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DBF</name>
      <description>DBF</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PCF</name>
      <description>PCF</description>
      <bitOffset>6</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>SAIF</name>
      <description>SAIF</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>SAF</name>
      <description>SAF</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>HPF</name>
      <description>HPF</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RA</name>
      <description>RA</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACHASHHI</name>
  <displayName>ETH_MACHASHHI</displayName>
  <description>ETH_MACHASHHI</description>
  <addressOffset>0x8</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>HTH</name>
      <description>HTH</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACHASHLO</name>
  <displayName>ETH_MACHASHLO</displayName>
  <description>ETH_MACHASHLO</description>
  <addressOffset>0xc</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>HTL</name>
      <description>HTL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACMIIADDR</name>
  <displayName>ETH_MACMIIADDR</displayName>
  <description>ETH_MACMIIADDR</description>
  <addressOffset>0x10</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffdf</resetMask>
  <fields>
    <field>
      <name>MB</name>
      <description>MB</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MW</name>
      <description>MW</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CR</name>
      <description>CR</description>
      <bitOffset>2</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>MR</name>
      <description>MR</description>
      <bitOffset>6</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>PA</name>
      <description>PA</description>
      <bitOffset>11</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACMIIDAT</name>
  <displayName>ETH_MACMIIDAT</displayName>
  <description>ETH_MACMIIDAT</description>
  <addressOffset>0x14</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>MD</name>
      <description>MD</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACFLWCTRL</name>
  <displayName>ETH_MACFLWCTRL</displayName>
  <description>ETH_MACFLWCTRL</description>
  <addressOffset>0x18</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffff00bf</resetMask>
  <fields>
    <field>
      <name>FCB_BPA</name>
      <description>FCB_BPA</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TFE</name>
      <description>TFE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RFE</name>
      <description>RFE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UP</name>
      <description>UP</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PLT</name>
      <description>PLT</description>
      <bitOffset>4</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>DZQP</name>
      <description>DZQP</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PT</name>
      <description>PT</description>
      <bitOffset>16</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACVLANTAG</name>
  <displayName>ETH_MACVLANTAG</displayName>
  <description>ETH_MACVLANTAG</description>
  <addressOffset>0x1c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0001ffff</resetMask>
  <fields>
    <field>
      <name>VLTI</name>
      <description>VLTI</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
    <field>
      <name>ETC</name>
      <description>ETC</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACRMTWUFRMFLT</name>
  <displayName>ETH_MACRMTWUFRMFLT</displayName>
  <description>ETH_MACRMTWUFRMFLT</description>
  <addressOffset>0x28</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>DAT</name>
      <description>DAT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACPMTCTRLSTS</name>
  <displayName>ETH_MACPMTCTRLSTS</displayName>
  <description>ETH_MACPMTCTRLSTS</description>
  <addressOffset>0x2c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x80000267</resetMask>
  <fields>
    <field>
      <name>PWRDWN</name>
      <description>PWRDWN</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MGKPKTEN</name>
      <description>MGKPKTEN</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RWKPKTEN</name>
      <description>RWKPKTEN</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MGKPRCVD</name>
      <description>MGKPRCVD</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RWKPRCVD</name>
      <description>RWKPRCVD</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>GLBLUCAST</name>
      <description>GLBLUCAST</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RWKUPFLTRST</name>
      <description>RWKUPFLTRST</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACINTSTS</name>
  <displayName>ETH_MACINTSTS</displayName>
  <description>ETH_MACINTSTS</description>
  <addressOffset>0x38</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000278</resetMask>
  <fields>
    <field>
      <name>PMTIS</name>
      <description>PMTIS</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MMCIS</name>
      <description>MMCIS</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MMCRXIS</name>
      <description>MMCRXIS</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>MMCTXIS</name>
      <description>MMCTXIS</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSTS</name>
      <description>TSTS</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACINTMSK</name>
  <displayName>ETH_MACINTMSK</displayName>
  <description>ETH_MACINTMSK</description>
  <addressOffset>0x3c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000208</resetMask>
  <fields>
    <field>
      <name>PMTIM</name>
      <description>PMTIM</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSIM</name>
      <description>TSIM</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACADDR0HI</name>
  <displayName>ETH_MACADDR0HI</displayName>
  <description>ETH_MACADDR0HI</description>
  <addressOffset>0x40</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x0000ffff</resetValue>
  <resetMask>0x0000ffff</resetMask>
  <fields>
    <field>
      <name>ADDRHI</name>
      <description>ADDRHI</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACADDR0LO</name>
  <displayName>ETH_MACADDR0LO</displayName>
  <description>ETH_MACADDR0LO</description>
  <addressOffset>0x44</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0xffffffff</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDRLO</name>
      <description>ADDRLO</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACADDR1HI</name>
  <displayName>ETH_MACADDR1HI</displayName>
  <description>ETH_MACADDR1HI</description>
  <addressOffset>0x48</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x0000ffff</resetValue>
  <resetMask>0xff00ffff</resetMask>
  <fields>
    <field>
      <name>ADDRHI</name>
      <description>ADDRHI</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
    <field>
      <name>MBC</name>
      <description>MBC</description>
      <bitOffset>24</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
    <field>
      <name>SA</name>
      <description>SA</description>
      <bitOffset>30</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AE</name>
      <description>AE</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACADDR1LO</name>
  <displayName>ETH_MACADDR1LO</displayName>
  <description>ETH_MACADDR1LO</description>
  <addressOffset>0x4c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0xffffffff</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDRLO</name>
      <description>ADDRLO</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACADDR2HI</name>
  <displayName>ETH_MACADDR2HI</displayName>
  <description>ETH_MACADDR2HI</description>
  <addressOffset>0x50</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x0000ffff</resetValue>
  <resetMask>0xff00ffff</resetMask>
  <fields>
    <field>
      <name>ADDRHI</name>
      <description>ADDRHI</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
    <field>
      <name>MBC</name>
      <description>MBC</description>
      <bitOffset>24</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
    <field>
      <name>SA</name>
      <description>SA</description>
      <bitOffset>30</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AE</name>
      <description>AE</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACADDR2LO</name>
  <displayName>ETH_MACADDR2LO</displayName>
  <description>ETH_MACADDR2LO</description>
  <addressOffset>0x54</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0xffffffff</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDRLO</name>
      <description>ADDRLO</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACADDR3HI</name>
  <displayName>ETH_MACADDR3HI</displayName>
  <description>ETH_MACADDR3HI</description>
  <addressOffset>0x58</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x0000ffff</resetValue>
  <resetMask>0xff00ffff</resetMask>
  <fields>
    <field>
      <name>ADDRHI</name>
      <description>ADDRHI</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
    <field>
      <name>MBC</name>
      <description>MBC</description>
      <bitOffset>24</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
    <field>
      <name>SA</name>
      <description>SA</description>
      <bitOffset>30</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AE</name>
      <description>AE</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MACADDR3LO</name>
  <displayName>ETH_MACADDR3LO</displayName>
  <description>ETH_MACADDR3LO</description>
  <addressOffset>0x5c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0xffffffff</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>ADDRLO</name>
      <description>ADDRLO</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MMCCTRL</name>
  <displayName>ETH_MMCCTRL</displayName>
  <description>ETH_MMCCTRL</description>
  <addressOffset>0x100</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000000f</resetMask>
  <fields>
    <field>
      <name>CNTRST</name>
      <description>CNTRST</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CNTSTOPRO</name>
      <description>CNTSTOPRO</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RSTONRD</name>
      <description>RSTONRD</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>CNTFREEZ</name>
      <description>CNTFREEZ</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
