Left-Hand/Yumud/targets/N32G45X/.pack/Nationstech/N32G45x_DFP.1.0.5/svd/N32G457.svd
<register>
  <name>ETH_MMCRXINT</name>
  <displayName>ETH_MMCRXINT</displayName>
  <description>ETH_MMCRXINT</description>
  <addressOffset>0x104</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00020060</resetMask>
  <fields>
    <field>
      <name>RXCRCERFIS</name>
      <description>RXCRCERFIS</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXALIGNERFIS</name>
      <description>RXALIGNERFIS</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXUCGFIS</name>
      <description>RXUCGFIS</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MMCTXINT</name>
  <displayName>ETH_MMCTXINT</displayName>
  <description>ETH_MMCTXINT</description>
  <addressOffset>0x108</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0020c000</resetMask>
  <fields>
    <field>
      <name>TXSCOLGFIS</name>
      <description>TXSCOLGFIS</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXMCOLGFIS</name>
      <description>TXMCOLGFIS</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXGFRMIS</name>
      <description>TXGFRMIS</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MMCRXINTMSK</name>
  <displayName>ETH_MMCRXINTMSK</displayName>
  <description>ETH_MMCRXINTMSK</description>
  <addressOffset>0x10c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00020060</resetMask>
  <fields>
    <field>
      <name>RXCRCERFIM</name>
      <description>RXCRCERFIM</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXALIGNERFIM</name>
      <description>RXALIGNERFIM</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RXUCGFIM</name>
      <description>RXUCGFIM</description>
      <bitOffset>17</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MMCTXINTMSK</name>
  <displayName>ETH_MMCTXINTMSK</displayName>
  <description>ETH_MMCTXINTMSK</description>
  <addressOffset>0x110</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0020c000</resetMask>
  <fields>
    <field>
      <name>TXSCOLGFIM</name>
      <description>TXSCOLGFIM</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXMCOLGFIM</name>
      <description>TXMCOLGFIM</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TXGFRMIM</name>
      <description>TXGFRMIM</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MMCTXGFASCCNT</name>
  <displayName>ETH_MMCTXGFASCCNT</displayName>
  <description>ETH_MMCTXGFASCCNT</description>
  <addressOffset>0x14c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CNT</name>
      <description>CNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MMCTXGFAMSCCNT</name>
  <displayName>ETH_MMCTXGFAMSCCNT</displayName>
  <description>ETH_MMCTXGFAMSCCNT</description>
  <addressOffset>0x150</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CNT</name>
      <description>CNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MMCTXGFCNT</name>
  <displayName>ETH_MMCTXGFCNT</displayName>
  <description>ETH_MMCTXGFCNT</description>
  <addressOffset>0x168</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CNT</name>
      <description>CNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MMCRXFCECNT</name>
  <displayName>ETH_MMCRXFCECNT</displayName>
  <description>ETH_MMCRXFCECNT</description>
  <addressOffset>0x194</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CNT</name>
      <description>CNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MMCRXFAECNT</name>
  <displayName>ETH_MMCRXFAECNT</displayName>
  <description>ETH_MMCRXFAECNT</description>
  <addressOffset>0x198</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CNT</name>
      <description>CNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_MMCRXGUFCNT</name>
  <displayName>ETH_MMCRXGUFCNT</displayName>
  <description>ETH_MMCRXGUFCNT</description>
  <addressOffset>0x1c4</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>CNT</name>
      <description>CNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_PTPTSCTRL</name>
  <displayName>ETH_PTPTSCTRL</displayName>
  <description>ETH_PTPTSCTRL</description>
  <addressOffset>0x700</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0000003f</resetMask>
  <fields>
    <field>
      <name>TSENA</name>
      <description>TSENA</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSCFUPDT</name>
      <description>TSCFUPDT</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSINIT</name>
      <description>TSINIT</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSUPDT</name>
      <description>TSUPDT</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSTRIG</name>
      <description>TSTRIG</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSADDREG</name>
      <description>TSADDREG</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_PTPSSINC</name>
  <displayName>ETH_PTPSSINC</displayName>
  <description>ETH_PTPSSINC</description>
  <addressOffset>0x704</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000ff</resetMask>
  <fields>
    <field>
      <name>SSINC</name>
      <description>SSINC</description>
      <bitOffset>0</bitOffset>
      <bitWidth>8</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_PTPSEC</name>
  <displayName>ETH_PTPSEC</displayName>
  <description>ETH_PTPSEC</description>
  <addressOffset>0x708</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>TSS</name>
      <description>TSS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_PTPNS</name>
  <displayName>ETH_PTPNS</displayName>
  <description>ETH_PTPNS</description>
  <addressOffset>0x70c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>TSSS</name>
      <description>TSSS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>31</bitWidth>
    </field>
    <field>
      <name>PN</name>
      <description>PN</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_PTPSECUP</name>
  <displayName>ETH_PTPSECUP</displayName>
  <description>ETH_PTPSECUP</description>
  <addressOffset>0x710</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>TSS</name>
      <description>TSS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_PTPNSUP</name>
  <displayName>ETH_PTPNSUP</displayName>
  <description>ETH_PTPNSUP</description>
  <addressOffset>0x714</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>TSSS</name>
      <description>TSSS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>31</bitWidth>
    </field>
    <field>
      <name>ADDSUB</name>
      <description>ADDSUB</description>
      <bitOffset>31</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_PTPTSADD</name>
  <displayName>ETH_PTPTSADD</displayName>
  <description>ETH_PTPTSADD</description>
  <addressOffset>0x718</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>TSA</name>
      <description>TSA</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_PTPTTSEC</name>
  <displayName>ETH_PTPTTSEC</displayName>
  <description>ETH_PTPTTSEC</description>
  <addressOffset>0x71c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>TTS</name>
      <description>TTS</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_PTPTTNS</name>
  <displayName>ETH_PTPTTNS</displayName>
  <description>ETH_PTPTTNS</description>
  <addressOffset>0x720</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>TTSLO</name>
      <description>TTSLO</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_DMABUSMOD</name>
  <displayName>ETH_DMABUSMOD</displayName>
  <description>ETH_DMABUSMOD</description>
  <addressOffset>0x1000</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00020101</resetValue>
  <resetMask>0x03ffff7f</resetMask>
  <fields>
    <field>
      <name>SWR</name>
      <description>SWR</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DA</name>
      <description>DA</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DSL</name>
      <description>DSL</description>
      <bitOffset>2</bitOffset>
      <bitWidth>5</bitWidth>
    </field>
    <field>
      <name>PBL</name>
      <description>PBL</description>
      <bitOffset>8</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
    <field>
      <name>PR</name>
      <description>PR</description>
      <bitOffset>14</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>FB</name>
      <description>FB</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RPBL</name>
      <description>RPBL</description>
      <bitOffset>17</bitOffset>
      <bitWidth>6</bitWidth>
    </field>
    <field>
      <name>USP</name>
      <description>USP</description>
      <bitOffset>23</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PBLX8</name>
      <description>PBLX8</description>
      <bitOffset>24</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AALB</name>
      <description>AALB</description>
      <bitOffset>25</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_DMATXPD</name>
  <displayName>ETH_DMATXPD</displayName>
  <description>ETH_DMATXPD</description>
  <addressOffset>0x1004</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>TPD</name>
      <description>TPD</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_DMARXPD</name>
  <displayName>ETH_DMARXPD</displayName>
  <description>ETH_DMARXPD</description>
  <addressOffset>0x1008</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>RPD</name>
      <description>RPD</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_DMARXDLADDR</name>
  <displayName>ETH_DMARXDLADDR</displayName>
  <description>ETH_DMARXDLADDR</description>
  <addressOffset>0x100c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>SRL</name>
      <description>SRL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_DMATXDLADDR</name>
  <displayName>ETH_DMATXDLADDR</displayName>
  <description>ETH_DMATXDLADDR</description>
  <addressOffset>0x1010</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xffffffff</resetMask>
  <fields>
    <field>
      <name>STL</name>
      <description>STL</description>
      <bitOffset>0</bitOffset>
      <bitWidth>32</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_DMASTS</name>
  <displayName>ETH_DMASTS</displayName>
  <description>ETH_DMASTS</description>
  <addressOffset>0x1014</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x3bffe7ff</resetMask>
  <fields>
    <field>
      <name>TI</name>
      <description>TI</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TPSS</name>
      <description>TPSS</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TU</name>
      <description>TU</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TJT</name>
      <description>TJT</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OVF</name>
      <description>OVF</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UNF</name>
      <description>UNF</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RI</name>
      <description>RI</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RU</name>
      <description>RU</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RPSS</name>
      <description>RPSS</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RWT</name>
      <description>RWT</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ETI</name>
      <description>ETI</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FBI</name>
      <description>FBI</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERI</name>
      <description>ERI</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AIS</name>
      <description>AIS</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>NIS</name>
      <description>NIS</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RPS</name>
      <description>RPS</description>
      <bitOffset>17</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>TPS</name>
      <description>TPS</description>
      <bitOffset>20</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>EB</name>
      <description>EB</description>
      <bitOffset>23</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>MMCI</name>
      <description>MMCI</description>
      <bitOffset>27</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>PMTI</name>
      <description>PMTI</description>
      <bitOffset>28</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TTI</name>
      <description>TTI</description>
      <bitOffset>29</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_DMAOPMOD</name>
  <displayName>ETH_DMAOPMOD</displayName>
  <description>ETH_DMAOPMOD</description>
  <addressOffset>0x1018</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0731e0de</resetMask>
  <fields>
    <field>
      <name>SR</name>
      <description>SR</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OSF</name>
      <description>OSF</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RTC</name>
      <description>RTC</description>
      <bitOffset>3</bitOffset>
      <bitWidth>2</bitWidth>
    </field>
    <field>
      <name>FUF</name>
      <description>FUF</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FEF</name>
      <description>FEF</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ST</name>
      <description>ST</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TTC</name>
      <description>TTC</description>
      <bitOffset>14</bitOffset>
      <bitWidth>3</bitWidth>
    </field>
    <field>
      <name>FTF</name>
      <description>FTF</description>
      <bitOffset>20</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TSF</name>
      <description>TSF</description>
      <bitOffset>21</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DFF</name>
      <description>DFF</description>
      <bitOffset>24</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RSF</name>
      <description>RSF</description>
      <bitOffset>25</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>DT</name>
      <description>DT</description>
      <bitOffset>26</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_DMAINTEN</name>
  <displayName>ETH_DMAINTEN</displayName>
  <description>ETH_DMAINTEN</description>
  <addressOffset>0x101c</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x0001e7ff</resetMask>
  <fields>
    <field>
      <name>TIE</name>
      <description>TIE</description>
      <bitOffset>0</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TPSE</name>
      <description>TPSE</description>
      <bitOffset>1</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TUE</name>
      <description>TUE</description>
      <bitOffset>2</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>TJTE</name>
      <description>TJTE</description>
      <bitOffset>3</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OVFE</name>
      <description>OVFE</description>
      <bitOffset>4</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>UNFE</name>
      <description>UNFE</description>
      <bitOffset>5</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RIE</name>
      <description>RIE</description>
      <bitOffset>6</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RUE</name>
      <description>RUE</description>
      <bitOffset>7</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RPSE</name>
      <description>RPSE</description>
      <bitOffset>8</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>RWTE</name>
      <description>RWTE</description>
      <bitOffset>9</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ETIE</name>
      <description>ETIE</description>
      <bitOffset>10</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>FBIE</name>
      <description>FBIE</description>
      <bitOffset>13</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>ERIE</name>
      <description>ERIE</description>
      <bitOffset>14</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>AISE</name>
      <description>AISE</description>
      <bitOffset>15</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>NISE</name>
      <description>NISE</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
<register>
  <name>ETH_DMAMFBOCNT</name>
  <displayName>ETH_DMAMFBOCNT</displayName>
  <description>ETH_DMAMFBOCNT</description>
  <addressOffset>0x1020</addressOffset>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x1fffffff</resetMask>
  <fields>
    <field>
      <name>MISFRMCNT</name>
      <description>MISFRMCNT</description>
      <bitOffset>0</bitOffset>
      <bitWidth>16</bitWidth>
    </field>
    <field>
      <name>MISCNTOVF</name>
      <description>MISCNTOVF</description>
      <bitOffset>16</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
    <field>
      <name>OVFFRMCNT</name>
      <description>OVFFRMCNT</description>
      <bitOffset>17</bitOffset>
      <bitWidth>11</bitWidth>
    </field>
    <field>
      <name>OVFCNTOVF</name>
      <description>OVFCNTOVF</description>
      <bitOffset>28</bitOffset>
      <bitWidth>1</bitWidth>
    </field>
  </fields>
</register>
